No problem, you are welcome. 

After careful checking, I found that there is a spelling error in your configuration file: type = wildcard_fqdn should be: type = "wildcard-fqdn"

Validation on FOS6.4.2:

**# cat maintst.tf**
```
provider "fortios" {
  hostname = "192.168.52.177"
  token = "GNH7r40H65GNb46kd4rG8rtrmn0fr1" # 6.4.2

  insecure = "true"
}

resource "fortios_firewall_sslsshprofile" "testing" {
  name = "testing"
  whitelist = "enable"
  ssl {
    inspect_all = "deep-inspection"
  }

  ssl_exempt {
    id = 3
    type = "wildcard-fqdn"
    wildcard_fqdn = "live.com"
  }
}
```

**# terraform plan**
...
**# terraform apply**
```

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # fortios_firewall_sslsshprofile.testing will be created
  + resource "fortios_firewall_sslsshprofile" "testing" {
      + caname             = (known after apply)
      + id                 = (known after apply)
      + mapi_over_https    = (known after apply)
      + name               = "testing"
      + rpc_over_https     = (known after apply)
      + server_cert        = (known after apply)
      + server_cert_mode   = (known after apply)
      + ssl_anomalies_log  = (known after apply)
      + ssl_exemptions_log = (known after apply)
      + untrusted_caname   = (known after apply)
      + use_ssl_server     = (known after apply)
      + whitelist          = "enable"

      + ssl {
          + client_cert_request   = (known after apply)
          + inspect_all           = "deep-inspection"
          + invalid_server_cert   = (known after apply)
          + sni_server_cert_check = (known after apply)
          + unsupported_ssl       = (known after apply)
          + untrusted_server_cert = (known after apply)
        }

      + ssl_exempt {
          + address             = (known after apply)
          + address6            = (known after apply)
          + fortiguard_category = (known after apply)
          + id                  = 3
          + regex               = (known after apply)
          + type                = "wildcard-fqdn"
          + wildcard_fqdn       = "live.com"
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Do you want to perform these actions?
  Terraform will perform the actions described above.
  Only 'yes' will be accepted to approve.

  Enter a value: yes

fortios_firewall_sslsshprofile.testing: Creating...
fortios_firewall_sslsshprofile.testing: Creation complete after 0s [id=testing]

Apply complete! Resources: 1 added, 0 changed, 0 destroyed.

```
